# # CREATE
# a = [1, 1.1, 'a', [1], (1, 1.1), {1, 2}, {1, 2}, {'a': 1}, None, True] # Список в котором: целое;вещественное; строковое; другой список; кортеж; множество; словарь; пустой тип4 булевый тип
# a = [] # Пустой список
# b = list() # Пустой список
# a = (1, 2.1, 3) # Раньше я был кортежем
# list(a) # [1, 2.1, 3], но 'a' остался кортежем
# b = list('abc') # ['a','b','c']
# # RETRIVE(Read0
# a = [1, 1.1, 'a']
# print (a) # [1, 1.1, 'a']
# print([1, 1.1, 'a']) # [1, 1.1, 'a']
# a = [1, 1.1, 'a']
# a = [0] # 1
# a = [1] # 1.1
# a = [2] # 'a'
# a = [3] # Ошибка, вышли за границы
# a = [-1] # 'a'
# a = [-2] # 1.1
# a = [-3] # 1
# a = [-4] # Ошибка, вышли за границы
#
# a = [1, 2,3]
# a.index(3) # 2. Возвращает индекс, где передаваемое значение стоит в списке. В примере вернётся 2, так как значение 3 в списке стоит на 2-ом индексею
# # UPDATE
# a = [1, 1.1, 'a']
# a = [0] = 'а'# Теперь 'a' равно ['',1.1,'']
# a = [1] = 'б' # Теперь 'a' равно ['а','б','а']
# a = [-1] = 'в' # Теперь 'a' равно ['а','б','в']
# a = [1, 2, 3] # Теперь 'a' равно [1,2,3]
# # DELETE
# a.clear()
# a.pop()
# a.remove()
# a = [1, 1.1, 'a']
# del a[0] # Теперь 'a' равно [1.1,'a']
# del a[-1] # Теперь 'a' равно [1.1]
# del a[-1] # Теперь 'a' равно []
# del a # Полное удаление переменной "a"
# a = [1, 2, 3]
# a.clear() # Полностью очищает список, превращая его в пустой список.Теперь "a" []
# a = [1,2,3]
# a.pop() # Возвращение
# a =[1,'ab', 3]
# a.pop(1)
# a = [1,2,'a']
# a.remove('ab')
# # ЗАДАЧА 1
# a = [2, -93, -2, 8, None, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]
# b = len(a)
# print (b)
# c = [2, -93, -2, 8, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]
# d = sum(c)
# e = d // 19
# print(e)
# a[4] = - 17
# print(a)
# #ЗАДАЧА 2
# list_players = ["Маша", "Петя", "Саша", "Оля", "Кирилл", "Коля"]
# b = len(list_players)
# print(b)
# #b [start : step : stop]
# print(list_players[0:3])
# print(list_players[3:6])
# ЗАДАЧА 3
##1
# mails = ["Письмо 1", "Письмо 2", "Письмо 3", "Письмо 4", "Письмо 5"]
# emails = mails[: : -1]
# print(emails)
##2
# mails = ["Письмо 1", "Письмо 2", "Письмо 3", "Письмо 4", "Письмо 5"]
# mails.reverse()
# print(mails)

# # ЗАДАЧА 4
# emails = ["Письмо 1", "Письмо 2", "Письмо 3", "Письмо 4", "Письмо 5"]
# a = emails[2]
# b = emails[3]
#
# print('Третье письмо:',a)
# print('Предпоследнее письмо:',b)

#  ## Задача 5
# results = [10, 8, 9, 7, 6, 9, 10, 8, 9, 10]
# a = sum(results)
# b = len(results)
# c = a//b
# print(c)
# min_score = min(results)
# max_score = max(results)
# print(min_score)
# print(max_score)

# ## Задача 6
# fruits = ["яблоко", "банан", "опельсин", "виноград"]
# fruits[2] = 'апельсин'
# print(fruits)

# ## Задача 7
# speed = 4096 / 1024
# time = 120 * 60
# coast = 0.125
# free = 500
# file = speed * time
# money = (file - free)*coast
# print(file)
# print(money)

# ## Задача 8
# money = 10000
# add = 5000
# money += add
# print(money)

# ## Задача 9
# group_124 = ['Дарья', 'Софья', 'Фатима', 'Елизавета', 'Алина', 'Эвилина', 'Элеонора', 'Маргарита', 'Полина', 'Юрий','Илья','Екатерина']
# group_1 = group_124[:6]
# group_2 = group_124[6:]
# print(group_1)
# print(group_2)







